In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.4.2'

In [3]:
games_url = 'http://andybek.com/pandas-games'

In [4]:
games = pd.read_csv(games_url)
games.head(n=6)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
5,Call of Duty: Black Ops 3,PS4,2015.0,Shooter,Activision,5.77,5.81,0.35,2.31,14.24

In [5]:
games.sort_values(by='JP_Sales', ascending=False).head(n=21)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
58,Final Fantasy XIII,PS3,2009.0,Role-Playing,Square Enix,1.74,1.24,1.87,0.52,5.36
64,Resident Evil 5,PS3,2009.0,Action,Capcom,1.96,1.43,1.08,0.65,5.11
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
181,Final Fantasy XIII-2,PS3,2011.0,Role-Playing,Square Enix,0.78,0.75,0.89,0.26,2.68
136,Resident Evil 6,PS3,2012.0,Shooter,Capcom,0.88,0.97,0.88,0.42,3.15
488,One Piece: Pirate Warriors,PS3,2012.0,Action,Namco Bandai Games,0.01,0.24,0.86,0.09,1.20
48,Metal Gear Solid 4: Guns of the Patriots,PS3,2008.0,Action,Konami Digital Entertainment,2.63,1.74,0.83,0.83,6.03
14,Gran Turismo 5,PS3,2010.0,Racing,Sony Computer Entertainment,2.96,4.88,0.81,2.12,10.77
513,Hot Shots Golf: Out of Bounds,PS3,2007.0,Sports,Sony Computer Entertainment,0.31,0.03,0.76,0.04,1.14
311,Dragon's Dogma,PS3,2012.0,Role-Playing,Capcom,0.41,0.46,0.72,0.19,1.78
474,Tales of Xillia,PS3,2011.0,Role-Playing,Namco Bandai Games,0.29,0.19,0.67,0.09,1.24
6,Call of Duty: Black Ops II,PS3,2012.0,Shooter,Activision,4.99,5.88,0.65,2.52,14.03
619,Yakuza 4,PS3,NaN,Action,Sega,0.15,0.14,0.63,0.05,0.97
520,Yakuza 3,PS3,2009.0,Action,Sega,0.21,0.21,0.62,0.08,1.13
986,Yakuza 5,PS3,2012.0,Action,Sega,0.00,0.00,0.59,0.00,0.59
90,Street Fighter IV,PS3,2009.0,Fighting,Capcom,2.02,1.06,0.58,0.53,4.19
952,Warriors Orochi 3,PS3,2011.0,Action,Ubisoft Annecy,0.00,0.04,0.57,0.01,0.62
88,Gran Turismo 5 Prologue,PS3,2007.0,Racing,Sony Computer Entertainment,1.28,1.83,0.57,0.53,4.20
239,Pro Evolution Soccer 2012,PS3,2011.0,Action,Konami Digital Entertainment,0.34,0.97,0.55,0.33,2.19
897,Fist of the North Star: Ken's Rage,PS3,2010.0,Action,Ubisoft Annecy,0.06,0.03,0.55,0.02,0.66
1058,Kidou Senshi Gundam: Extreme VS,PS3,2011.0,Fighting,Namco Bandai Games,0.00,0.00,0.54,0.00,0.54

In [6]:
games.describe()

,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,3088.000000,3143.000000,3143.000000,3143.000000,3143.000000,3143.000000
mean,2011.174223,0.373306,0.252510,0.034063,0.089962,0.749908
std,2.877156,0.801483,0.570164,0.093115,0.203866,1.500717
min,2005.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,2009.000000,0.040000,0.010000,0.000000,0.010000,0.100000
50%,2011.000000,0.140000,0.070000,0.000000,0.030000,0.270000
75%,2014.000000,0.360000,0.250000,0.030000,0.090000,0.770000
max,2017.000000,14.970000,9.270000,1.870000,4.140000,21.820000

In [7]:
games.sum()

C:\Users\Tom\AppData\Local\Temp\ipykernel_10548\1599516262.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  games.sum()

Name            Kinect Adventures!Grand Theft Auto VGrand Thef...
Platform        X360PS3X360X360X360PS4PS3X360X360PS3PS3X360PS4...
Year                                                    6210506.0
Genre           MiscActionActionShooterShooterShooterShooterSh...
NA_Sales                                                   1173.3
EU_Sales                                                   793.64
JP_Sales                                                   107.06
Other_Sales                                                282.75
Global_Sales                                              2356.96
dtype: object

# 196. Simple aggregations Review

In [8]:
# previously aggregates: mean, sum, std, var

In [9]:
# What are the total sales across all regions?

In [10]:
games.columns.shape
country_sales = games.columns[5:10].values
games.loc[:,country_sales]

      NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        14.97      4.94      0.24         1.67         21.82
1         7.01      9.27      0.97         4.14         21.40
2         9.63      5.31      0.06         1.38         16.38
3         9.03      4.28      0.13         1.32         14.76
4         9.67      3.73      0.11         1.13         14.64
...        ...       ...       ...          ...           ...
3138      0.00      0.01      0.00         0.00          0.01
3139      0.01      0.00      0.00         0.00          0.01
3140      0.01      0.00      0.00         0.00          0.01
3141      0.00      0.01      0.00         0.00          0.01
3142      0.00      0.01      0.00         0.00          0.01

[3143 rows x 5 columns]

In [11]:
games.loc[:,country_sales].sum()

NA_Sales        1173.30
EU_Sales         793.64
JP_Sales         107.06
Other_Sales      282.75
Global_Sales    2356.96
dtype: float64

In [12]:
games.columns.shape

(10,)

In [13]:
games.columns.shape[0]

10

In [14]:
games.head(n=1)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82

In [15]:
games.columns

Index(['Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [16]:
list_columns = list(games.columns.values)

In [17]:
list_columns

['Name',
 'Platform',
 'Year',
 'Genre',
 'Publisher',
 'NA_Sales',
 'EU_Sales',
 'JP_Sales',
 'Other_Sales',
 'Global_Sales']

In [18]:
list_columns.index('NA_Sales')

5

In [19]:
list_columns[list_columns.index('NA_Sales'):]

['NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales']

In [20]:
type(list_columns[list_columns.index('NA_Sales'):])

list

In [21]:
index_my_countrys = list_columns[list_columns.index('NA_Sales'):]
type(index_my_countrys)

list

In [22]:
index_my_countrys

['NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales']

In [23]:
games.loc[:,index_my_countrys]

      NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        14.97      4.94      0.24         1.67         21.82
1         7.01      9.27      0.97         4.14         21.40
2         9.63      5.31      0.06         1.38         16.38
3         9.03      4.28      0.13         1.32         14.76
4         9.67      3.73      0.11         1.13         14.64
...        ...       ...       ...          ...           ...
3138      0.00      0.01      0.00         0.00          0.01
3139      0.01      0.00      0.00         0.00          0.01
3140      0.01      0.00      0.00         0.00          0.01
3141      0.00      0.01      0.00         0.00          0.01
3142      0.00      0.01      0.00         0.00          0.01

[3143 rows x 5 columns]

In [24]:
games.loc[:,index_my_countrys].max(axis=0)

NA_Sales        14.97
EU_Sales         9.27
JP_Sales         1.87
Other_Sales      4.14
Global_Sales    21.82
dtype: float64

In [25]:
games.loc[:,index_my_countrys].max(axis=1)

0       21.82
1       21.40
2       16.38
3       14.76
4       14.64
        ...
3138     0.01
3139     0.01
3140     0.01
3141     0.01
3142     0.01
Length: 3143, dtype: float64

# 197. Conditional Agregates

In [26]:

games.loc[:,index_my_countrys].max(axis=0)

NA_Sales        14.97
EU_Sales         9.27
JP_Sales         1.87
Other_Sales      4.14
Global_Sales    21.82
dtype: float64

In [27]:
14.97 + 9.27 + 1.87 + 4.14 - 21.82

8.430000000000003

In [28]:
games.Platform.unique()

array(['X360', 'PS3', 'PS4', 'XOne'], dtype=object)

In [29]:
# Q: find the total sales by region for x360 and PS3

In [30]:
games.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64

In [31]:
#    1145 # ugly hack for GH #836
#    1146 if self._multi_take_opportunity(tup):
# -> 1147     return self._multi_take(tup)
#    1149 return self._getitem_tuple_same_dim(tup)

sales = games.loc[:,['Platform'] + index_my_countrys]

In [32]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
1         PS3      7.01      9.27      0.97         4.14         21.40
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
...       ...       ...       ...       ...          ...           ...
3138     X360      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[3143 rows x 6 columns]

In [33]:
sales.sum()

Platform        X360PS3X360X360X360PS4PS3X360X360PS3PS3X360PS4...
NA_Sales                                                   1173.3
EU_Sales                                                   793.64
JP_Sales                                                   107.06
Other_Sales                                                282.75
Global_Sales                                              2356.96
dtype: object

In [34]:
sales.sum(axis=0)

Platform        X360PS3X360X360X360PS4PS3X360X360PS3PS3X360PS4...
NA_Sales                                                   1173.3
EU_Sales                                                   793.64
JP_Sales                                                   107.06
Other_Sales                                                282.75
Global_Sales                                              2356.96
dtype: object

In [35]:
sales.sum(axis=1)

C:\Users\Tom\AppData\Local\Temp\ipykernel_10548\2518183184.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sales.sum(axis=1)

0       43.64
1       42.79
2       32.76
3       29.52
4       29.28
        ...
3138     0.02
3139     0.02
3140     0.02
3141     0.02
3142     0.02
Length: 3143, dtype: float64

In [36]:
sales.sum(numeric_only=True)

NA_Sales        1173.30
EU_Sales         793.64
JP_Sales         107.06
Other_Sales      282.75
Global_Sales    2356.96
dtype: float64

In [37]:
type(sales.sum(numeric_only=True))

pandas.core.series.Series

In [38]:
list(sales.sum(numeric_only=True))

[1173.3, 793.64, 107.06, 282.75, 2356.96]

In [39]:
sales_check = list(sales.sum(numeric_only=True))

In [40]:
sales_region_sum  = 0 

for i in sales_check:
    if i != sales_check[-1]:
        sales_region_sum += i

sales_region_sum - sales_check[-1]

-0.21000000000003638

In [41]:
sales.loc[games.Platform == 'X360'].sum(numeric_only=True)

NA_Sales        601.05
EU_Sales        280.58
JP_Sales         12.43
Other_Sales      85.54
Global_Sales    979.96
dtype: float64

In [42]:
sales.loc[games.Platform == 'PS3'].sum(numeric_only=True)

NA_Sales        392.26
EU_Sales        343.71
JP_Sales         79.99
Other_Sales     141.93
Global_Sales    957.84
dtype: float64

# 198. The split-apply-combine pattern

In [43]:
# 1. Separate the data
sales.loc[games.Platform == 'X360']
sales.loc[games.Platform == 'PS3']

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         PS3      7.01      9.27      0.97         4.14         21.40
6         PS3      4.99      5.88      0.65         2.52         14.03
9         PS3      5.54      5.82      0.49         1.62         13.46
10        PS3      5.98      4.44      0.48         1.83         12.73
14        PS3      2.96      4.88      0.81         2.12         10.77
...       ...       ...       ...       ...          ...           ...
3124      PS3      0.00      0.01      0.00         0.00          0.01
3125      PS3      0.00      0.00      0.01         0.00          0.01
3129      PS3      0.00      0.00      0.01         0.00          0.01
3132      PS3      0.00      0.00      0.01         0.00          0.01
3136      PS3      0.00      0.00      0.01         0.00          0.01

[1329 rows x 6 columns]

In [44]:
# 2. Calculate sume
sales.loc[games.Platform == 'X360'].sum(numeric_only=True)
sales.loc[games.Platform == 'PS3'].sum(numeric_only=True)

NA_Sales        392.26
EU_Sales        343.71
JP_Sales         79.99
Other_Sales     141.93
Global_Sales    957.84
dtype: float64

# 199. the groupby() method

In [45]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
1         PS3      7.01      9.27      0.97         4.14         21.40
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
...       ...       ...       ...       ...          ...           ...
3138     X360      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[3143 rows x 6 columns]

In [46]:
# Q: find the total sales by region for X360 and PS3.

In [47]:
sales.groupby('Platform').sum()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [48]:
# Q: how much does each platform sell across regions, on average.

In [49]:
sales.groupby('Platform').mean()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3       0.295154  0.258623  0.060188     0.106795      0.720722
PS4       0.288095  0.368155  0.042560     0.129048      0.827679
X360      0.475138  0.221802  0.009826     0.067621      0.774672
XOne      0.390563  0.214319  0.001596     0.055962      0.662254

In [50]:
sales.groupby('Platform').describe()

         NA_Sales                                                    EU_Sales  \
            count      mean       std  min   25%   50%    75%    max    count
Platform
PS3        1329.0  0.295154  0.578325  0.0  0.01  0.12  0.320   7.01   1329.0
PS4         336.0  0.288095  0.594151  0.0  0.00  0.07  0.305   5.77    336.0
X360       1265.0  0.475138  1.031488  0.0  0.08  0.17  0.450  14.97   1265.0
XOne        213.0  0.390563  0.641796  0.0  0.03  0.15  0.390   4.52    213.0

                    ... Other_Sales       Global_Sales                      \
              mean  ...         75%   max        count      mean       std
Platform            ...
PS3       0.258623  ...        0.11  4.14       1329.0  0.720722  1.412850
PS4       0.368155  ...        0.13  2.31        336.0  0.827679  1.618966
X360      0.221802  ...        0.07  1.67       1265.0  0.774672  1.618906
XOne      0.214319  ...        0.06  0.67        213.0  0.662254  1.039298


           min   25%   50%   75%    max
Platform
PS3       0.01  0.11  0.28  0.77  21.40
PS4       0.01  0.06  0.22  0.82  14.24
X360      0.01  0.11  0.28  0.77  21.82
XOne      0.01  0.07  0.24  0.68   7.30

[4 rows x 40 columns]

In [51]:
sales.groupby('Platform').median()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3           0.12      0.07      0.01         0.03          0.28
PS4           0.07      0.08      0.02         0.03          0.22
X360          0.17      0.06      0.00         0.02          0.28
XOne          0.15      0.07      0.00         0.02          0.24

200. Customizing index to group mappings

In [52]:
sales.groupby('Platform').sum() # + .mean(), .median()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [53]:
sales.groupby('Platform')

In [54]:
len(sales.groupby('Platform'))

4

# 201. Bonus Customizing index to group Mappings

In [56]:
sales.groupby('Platform').sum()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [58]:
# eqivalent to:

In [57]:
sales.groupby(sales['Platform']).sum()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [59]:
sales.Platform.unique()

array(['X360', 'PS3', 'PS4', 'XOne'], dtype=object)

In [60]:
# -> PlayStation, XBox

In [63]:
platform_names = {
    'PS3':'PlayStation',
    'PS4':'PlayStation',
    'X360':'XBox',
    'XOne':'XBox'
}

In [65]:
platform_names

{'PS3': 'PlayStation', 'PS4': 'PlayStation', 'X360': 'XBox', 'XOne': 'XBox'}

In [66]:
sales.set_index('Platform')

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
X360         14.97      4.94      0.24         1.67         21.82
PS3           7.01      9.27      0.97         4.14         21.40
X360          9.63      5.31      0.06         1.38         16.38
X360          9.03      4.28      0.13         1.32         14.76
X360          9.67      3.73      0.11         1.13         14.64
...            ...       ...       ...          ...           ...
X360          0.00      0.01      0.00         0.00          0.01
XOne          0.01      0.00      0.00         0.00          0.01
XOne          0.01      0.00      0.00         0.00          0.01
PS4           0.00      0.01      0.00         0.00          0.01
XOne          0.00      0.01      0.00         0.00          0.01

[3143 rows x 5 columns]

In [67]:
sales.set_index('Platform').groupby(platform_names).sum()

             NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PlayStation    489.06    467.41     94.29       185.29       1235.94
XBox           684.24    326.23     12.77        97.46       1121.02

In [68]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
1         PS3      7.01      9.27      0.97         4.14         21.40
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
...       ...       ...       ...       ...          ...           ...
3138     X360      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[3143 rows x 6 columns]

# 202 - BONUS - Series group()

In [69]:
# epitomize -> be the perfect example of

In [70]:
# groupby -> aplit=apply-combine

In [71]:
games.head(n=3)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38

In [72]:
games.loc[:,['Genre','Global_Sales']].set_index('Genre')

              Global_Sales
Genre
Misc                 21.82
Action               21.40
Action               16.38
Shooter              14.76
Shooter              14.64
...                    ...
Role-Playing          0.01
Platform              0.01
Shooter               0.01
Simulation            0.01
Sports                0.01

[3143 rows x 1 columns]

In [73]:
type(games.loc[:,['Genre','Global_Sales']].set_index('Genre'))

pandas.core.frame.DataFrame

In [75]:
games.loc[:,['Genre','Global_Sales']].set_index('Genre').squeeze()

Genre
Misc            21.82
Action          21.40
Action          16.38
Shooter         14.76
Shooter         14.64
                ...
Role-Playing     0.01
Platform         0.01
Shooter          0.01
Simulation       0.01
Sports           0.01
Name: Global_Sales, Length: 3143, dtype: float64

In [76]:
type(games.loc[:,['Genre','Global_Sales']].set_index('Genre').squeeze())

pandas.core.series.Series

In [77]:
ser = games.loc[:,['Genre','Global_Sales']].set_index('Genre').squeeze()

In [78]:
type(ser)

pandas.core.series.Series

In [79]:
ser.head(n=11)

Genre
Misc       21.82
Action     21.40
Action     16.38
Shooter    14.76
Shooter    14.64
Shooter    14.24
Shooter    14.03
Shooter    13.73
Shooter    13.51
Shooter    13.46
Shooter    12.73
Name: Global_Sales, dtype: float64

In [82]:
ser.groupby('Genre').sum()

Genre
Action          671.40
Adventure        45.34
Fighting         99.69
Misc            154.07
Platform         49.54
Puzzle            1.47
Racing          160.27
Role-Playing    182.53
Shooter         601.52
Simulation       26.55
Sports          348.72
Strategy         15.86
Name: Global_Sales, dtype: float64

In [88]:
ser.groupby('Genre').mean().sort_values(ascending=False)

Genre
Shooter         1.412019
Action          0.751007
Role-Playing    0.715804
Racing          0.687854
Sports          0.681094
Platform        0.651842
Fighting        0.604182
Misc            0.550250
Simulation      0.336076
Adventure       0.298289
Strategy        0.264333
Puzzle          0.133636
Name: Global_Sales, dtype: float64

In [90]:
ser.groupby('Genre')

# 203 Skill Challenge

In [91]:
# 1 Create a smaller datafram from games, selecting only the publisher, genre, platform and NA_Sales columns. Assign thie datafram to the variable publishers.

In [92]:
games.head(n=1)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82

In [96]:
publisher_columns = ['Publisher','Genre','Platform','Platform','NA_Sales']
publishers = games.loc[:,publisher_columns]
publishers.head(n=3)

                Publisher   Genre Platform Platform  NA_Sales
0  Microsoft Game Studios    Misc     X360     X360     14.97
1    Take-Two Interactive  Action      PS3      PS3      7.01
2    Take-Two Interactive  Action     X360     X360      9.63

In [97]:
# 2. From the publishers datafram, find the top 10 games publishers in North America by total sales

In [101]:
publishers.groupby('Publisher').sum().sort_values(by='NA_Sales',ascending=False).head(n=10)

                                        NA_Sales
Publisher
Electronic Arts                           213.38
Activision                                193.16
Take-Two Interactive                      120.99
Microsoft Game Studios                    116.77
Ubisoft                                    98.65
Sony Computer Entertainment                76.35
Warner Bros. Interactive Entertainment     45.24
THQ                                        36.44
Bethesda Softworks                         33.88
Capcom                                     24.74